In [86]:
#quiz 

import pandas as pd

cells = {"A": {1: "A1", 2: "A1", 3: "A3"},
         "B": {1: "B1", 2: "B2", 3: "B2"},
         "C": {1: "C1", 2: "C2", 3: "C3"},
         "D": {1: "1", 2: "2", 3: "3"}}
df = pd.DataFrame(cells)


#change column D to type float:
df[['D']] = df[['D']].astype('float')
print(df)

    A   B   C    D
1  A1  B1  C1  1.0
2  A1  B2  C2  2.0
3  A3  B2  C3  3.0

In [87]:
#multiply column D by 5:

df['D'] = df['D'].apply(lambda x: x*5)
print(df)

    A   B   C     D
1  A1  B1  C1   5.0
2  A1  B2  C2  10.0
3  A3  B2  C3  15.0

In [88]:
#print rows where column A == 'A1'
print(df.loc[df['A'] == 'A1'])

    A   B   C     D
1  A1  B1  C1   5.0
2  A1  B2  C2  10.0

In [89]:
cells2 = {"A": {1: 1, 2: 5, 3: 3},
         "B": {1: 2, 2: 6, 3: 3},
         "C": {1: 3, 2: 7, 3: 3},
         "D": {1: 4, 2: 8, 3: 3}}
dfnumbers = pd.DataFrame(cells2)

print(dfnumbers)

   A  B  C  D
1  1  2  3  4
2  5  6  7  8
3  3  3  3  3

In [90]:
#show the count, mean, std, min, max, and quantiles with a single command for dfnumbers:

dfnumbers.describe()

         A         B         C         D
count  3.0  3.000000  3.000000  3.000000
mean   3.0  3.666667  4.333333  5.000000
std    2.0  2.081666  2.309401  2.645751
min    1.0  2.000000  3.000000  3.000000
25%    2.0  2.500000  3.000000  3.500000
50%    3.0  3.000000  3.000000  4.000000
75%    4.0  4.500000  5.000000  6.000000
max    5.0  6.000000  7.000000  8.000000

In [91]:
#create a new column in dfnumbers called 'mult' and make it the product of df['D'] and dfnumbers['A']
# then print dfnumbers

dfnumbers['mult']= df['D'] * dfnumbers['A']
print(dfnumbers)

   A  B  C  D  mult
1  1  2  3  4   5.0
2  5  6  7  8  50.0
3  3  3  3  3  45.0

In [92]:
#append dfnumbers to the end of df.  Df should now be 6 rows. print df.
pd.concat([df, dfnumbers])
print(df)
print(dfnumbers)
df= pd.concat([df, dfnumbers])
print(df)

    A   B   C     D
1  A1  B1  C1   5.0
2  A1  B2  C2  10.0
3  A3  B2  C3  15.0
   A  B  C  D  mult
1  1  2  3  4   5.0
2  5  6  7  8  50.0
3  3  3  3  3  45.0
    A   B   C     D  mult
1  A1  B1  C1   5.0   NaN
2  A1  B2  C2  10.0   NaN
3  A3  B2  C3  15.0   NaN
1   1   2   3   4.0   5.0
2   5   6   7   8.0  50.0
3   3   3   3   3.0  45.0

In [93]:
#Fill the NaN values in df with 99
df=df.fillna(value=99)
print(df)

    A   B   C     D  mult
1  A1  B1  C1   5.0  99.0
2  A1  B2  C2  10.0  99.0
3  A3  B2  C3  15.0  99.0
1   1   2   3   4.0   5.0
2   5   6   7   8.0  50.0
3   3   3   3   3.0  45.0

In [94]:
#in dataframe df, set column 'B' to be the index and drop column B
df= df.set_index(df['B'])
df= df.drop(['B'], axis=1)
print(df)

     A   C     D  mult
B
B1  A1  C1   5.0  99.0
B2  A1  C2  10.0  99.0
B2  A3  C3  15.0  99.0
2    1   3   4.0   5.0
6    5   7   8.0  50.0
3    3   3   3.0  45.0

In [95]:
#change the names of the columns of df to 'first','second','third','fourth'

df.columns= ['first', 'second', 'third', 'fourth']
print(df)

   first second  third  fourth
B
B1    A1     C1    5.0    99.0
B2    A1     C2   10.0    99.0
B2    A3     C3   15.0    99.0
2      1      3    4.0     5.0
6      5      7    8.0    50.0
3      3      3    3.0    45.0

In [96]:
# using the pivot command, pivot dataframe df with index being the first column, 
#the columns being the second column, and the values being the fourth column.  
#There will be NaN's

df.pivot(index= 'first', columns= 'second', values= 'fourth')

second     3     7    C1    C2    C3
first
1        5.0   NaN   NaN   NaN   NaN
3       45.0   NaN   NaN   NaN   NaN
5        NaN  50.0   NaN   NaN   NaN
A1       NaN   NaN  99.0  99.0   NaN
A3       NaN   NaN   NaN   NaN  99.0